{-# OPTIONS --without-K --safe #-}

open import Examples.Groups.Clifford+CS.Four.WinSig using (Ws ; wn)
open import Examples.Groups.Clifford+CS.Four.DEqn using (wE)

module Examples.Groups.Clifford+CS.Four.D.D447 (W : Ws) where

open import Data.List.Base using (List ; [] ; _∷_)
open import Data.Unit.Base using (tt)
open import Relation.Binary.PropositionalEquality as Eq using ()
open import Word.Base using (ε ; _•_)
open import Examples.Groups.Clifford+CS.Syntactics
open import Examples.Groups.Clifford+CS.MultiControlled using (CZ ; CK₀₁ ; CK₁₀ ; Toffᵗ)
open import Examples.Groups.Clifford+CS.Tools using (ax)
open import Examples.Groups.Clifford+CS.LowComm using (low-comm ; low₁-comm)
open import Examples.Groups.Clifford+CS.Four.Chain hiding (Step ; step′ ; at ; Chain ; done ; _▸_ ; run)
open import Examples.Groups.Clifford+CS.Four.Reflect using (Eqn ; eqn ; rw ; rw⁻ ; re ; derive)
open import Examples.Groups.Clifford+CS.Four.Str using (ℓ)

private
  q1 : Eqn
  q1 = wE 1194 W
  q2 : Eqn
  q2 = wE 1 W
  q3 : Eqn
  q3 = wE 20 W
  q4 : Eqn
  q4 = eqn (ℓ "丵义") (ℓ "义丵") (low-comm ((S ↑ • CK₁₀)) (CS))
  q5 : Eqn
  q5 = wE 49 W
  q6 : Eqn
  q6 = wE 3 W
  q7 : Eqn
  q7 = eqn (ℓ "両乏") (ℓ "乏両") (low-comm ((CS • CS • CS)) (Swap))
  q8 : Eqn
  q8 = wE 102 W
  q9 : Eqn
  q9 = eqn (ℓ "丵乏") (ℓ "乏丵") (low-comm ((S ↑ • CK₁₀)) (Swap))
  q10 : Eqn
  q10 = wE 1140 W
  q11 : Eqn
  q11 = eqn (ℓ "丠乏") (ℓ "乏丠") (low-comm (CS) (Swap))
  q12 : Eqn
  q12 = wE 103 W
  q13 : Eqn
  q13 = eqn (ℓ "临义") (ℓ "义临") (low-comm (CK₁₀) (CS))
  q14 : Eqn
  q14 = eqn (ℓ "临乏") (ℓ "乏临") (low-comm (CK₁₀) (Swap))
  q15 : Eqn
  q15 = wE 607 W
  q16 : Eqn
  q16 = wE 5 W
  q17 : Eqn
  q17 = eqn (ℓ "並乌") (ℓ "乌並") (low-comm (Swap) (CX₀₁))
  q18 : Eqn
  q18 = wE 137 W
  q19 : Eqn
  q19 = wE 1193 W
  q20 : Eqn
  q20 = wE 139 W
  q21 : Eqn
  q21 = wE 31 W
  q22 : Eqn
  q22 = eqn (ℓ "両乌") (ℓ "乌両") (low-comm ((CS • CS • CS)) (CX₀₁))
  q23 : Eqn
  q23 = eqn (ℓ "丵乌") (ℓ "乌丵") (low-comm ((S ↑ • CK₁₀)) (CX₀₁))
  q24 : Eqn
  q24 = eqn (ℓ "丠乌") (ℓ "乌丠") (low-comm (CS) (CX₀₁))
  q25 : Eqn
  q25 = wE 140 W
  q26 : Eqn
  q26 = wE 917 W
  q27 : Eqn
  q27 = wE 142 W
  q28 : Eqn
  q28 = eqn (ℓ "临乌") (ℓ "乌临") (low-comm (CK₁₀) (CX₀₁))
  q29 : Eqn
  q29 = wE 21 W
  q30 : Eqn
  q30 = eqn (ℓ "丵乊") (ℓ "乊丵") (low-comm ((S ↑ • CK₁₀)) ((CS • CS • CS)))
  q31 : Eqn
  q31 = wE 51 W
  q32 : Eqn
  q32 = wE 199 W
  q33 : Eqn
  q33 = wE 1142 W
  q34 : Eqn
  q34 = wE 200 W
  q35 : Eqn
  q35 = eqn (ℓ "临乊") (ℓ "乊临") (low-comm (CK₁₀) ((CS • CS • CS)))
  q36 : Eqn
  q36 = wE 609 W

-- groups [CS01 CK10 CSd01 CK20 CS01 CKd10 CSd01 CKd20] [CS12 CS13 CX23 CSd13 CX23]: 209 steps
lem-groups-CS01-CK10-CSd01-CK20-CS01-CKd10-CSd01-CKd20-vs-CS12-CS13-CX23-CSd13-CX23 : ⟪ (ℓ "丠临両乄丠丵両久丶丽乌举乌") ⟫ʷ ≈ ⟪ (ℓ "丶丽乌举乌丠临両乄丠丵両久") ⟫ʷ
lem-groups-CS01-CK10-CSd01-CK20-CS01-CKd10-CSd01-CKd20-vs-CS12-CS13-CX23-CSd13-CX23 = derive (ℓ "丠临両乄丠丵両久丶丽乌举乌") (ℓ "丶丽乌举乌丠临両乄丠丵両久")
  (rw 0 q1 ∷
   re 9 1 (ℓ "乏丶乏") ∷
   rw 8 q2 ∷
   re 9 3 (ℓ "乒") ∷
   re 9 1 (ℓ "乏丼丵丼乏") ∷
   rw 15 q2 ∷
   re 13 3 (ℓ "丽") ∷
   rw 12 q3 ∷
   rw 11 q4 ∷
   rw 10 q5 ∷
   re 10 1 (ℓ "乏丶乏") ∷
   rw 9 q6 ∷
   re 10 5 (ℓ "乒") ∷
   re 10 1 (ℓ "乏久乏") ∷
   rw 12 q6 ∷
   re 8 3 (ℓ "丽") ∷
   rw 9 q2 ∷
   re 8 1 (ℓ "乏丶乏") ∷
   rw 10 q6 ∷
   rw 7 q7 ∷
   rw 8 q8 ∷
   rw 9 q2 ∷
   re 7 3 (ℓ "丽") ∷
   rw⁻ 8 q7 ∷
   rw 9 q6 ∷
   rw 8 q2 ∷
   re 7 1 (ℓ "乏丶乏") ∷
   rw 9 q6 ∷
   rw 6 q9 ∷
   rw 7 q10 ∷
   rw 8 q2 ∷
   re 6 3 (ℓ "丽") ∷
   rw⁻ 7 q9 ∷
   rw 8 q6 ∷
   rw 7 q2 ∷
   re 6 1 (ℓ "乏丶乏") ∷
   rw 8 q6 ∷
   rw 5 q11 ∷
   rw 6 q12 ∷
   rw 7 q2 ∷
   re 5 3 (ℓ "丽") ∷
   rw⁻ 6 q11 ∷
   rw 7 q6 ∷
   re 5 1 (ℓ "乏丶乏") ∷
   rw 4 q2 ∷
   re 5 3 (ℓ "乑") ∷
   re 5 1 (ℓ "乏丼临丼乏") ∷
   rw 11 q2 ∷
   re 9 3 (ℓ "丽") ∷
   rw 8 q3 ∷
   rw 7 q13 ∷
   rw 6 q5 ∷
   re 6 1 (ℓ "乏丶乏") ∷
   rw 5 q6 ∷
   re 6 5 (ℓ "乑") ∷
   re 6 1 (ℓ "乏乄乏") ∷
   rw 8 q6 ∷
   re 4 3 (ℓ "丽") ∷
   rw 5 q2 ∷
   re 4 1 (ℓ "乏丶乏") ∷
   rw 6 q6 ∷
   rw 3 q7 ∷
   rw 4 q8 ∷
   rw 5 q2 ∷
   re 3 3 (ℓ "丽") ∷
   rw⁻ 4 q7 ∷
   rw 5 q6 ∷
   rw 4 q2 ∷
   re 3 1 (ℓ "乏丶乏") ∷
   rw 5 q6 ∷
   rw 2 q14 ∷
   rw 3 q15 ∷
   rw 4 q2 ∷
   re 2 3 (ℓ "丽") ∷
   rw⁻ 3 q14 ∷
   rw 4 q6 ∷
   rw 3 q2 ∷
   re 2 1 (ℓ "乏丶乏") ∷
   rw 4 q6 ∷
   rw 1 q11 ∷
   rw 2 q12 ∷
   rw 3 q2 ∷
   re 1 3 (ℓ "丽") ∷
   rw⁻ 2 q11 ∷
   rw 3 q6 ∷
   rw 11 q16 ∷
   rw⁻ 10 q17 ∷
   rw 9 q18 ∷
   rw 10 q19 ∷
   rw 9 q17 ∷
   rw 10 q20 ∷
   rw 11 q21 ∷
   rw 8 q22 ∷
   rw 7 q23 ∷
   rw 6 q24 ∷
   rw 7 q16 ∷
   rw⁻ 6 q17 ∷
   rw 5 q25 ∷
   rw 6 q26 ∷
   rw 5 q17 ∷
   rw 6 q27 ∷
   rw 7 q21 ∷
   rw 4 q22 ∷
   rw 3 q28 ∷
   rw 2 q24 ∷
   re 11 1 (ℓ "乏丷乏") ∷
   rw 10 q2 ∷
   re 11 3 (ℓ "乒") ∷
   re 11 1 (ℓ "乏丼丵丼乏") ∷
   rw 17 q2 ∷
   re 15 3 (ℓ "举") ∷
   rw 14 q29 ∷
   rw 13 q30 ∷
   rw 12 q31 ∷
   re 12 1 (ℓ "乏丷乏") ∷
   rw 11 q6 ∷
   re 12 5 (ℓ "乒") ∷
   re 12 1 (ℓ "乏久乏") ∷
   rw 14 q6 ∷
   re 10 3 (ℓ "举") ∷
   rw 11 q2 ∷
   re 10 1 (ℓ "乏丷乏") ∷
   rw 12 q6 ∷
   rw 9 q7 ∷
   rw 10 q32 ∷
   rw 11 q2 ∷
   re 9 3 (ℓ "举") ∷
   rw⁻ 10 q7 ∷
   rw 11 q6 ∷
   rw 10 q2 ∷
   re 9 1 (ℓ "乏丷乏") ∷
   rw 11 q6 ∷
   rw 8 q9 ∷
   rw 9 q33 ∷
   rw 10 q2 ∷
   re 8 3 (ℓ "举") ∷
   rw⁻ 9 q9 ∷
   rw 10 q6 ∷
   rw 9 q2 ∷
   re 8 1 (ℓ "乏丷乏") ∷
   rw 10 q6 ∷
   rw 7 q11 ∷
   rw 8 q34 ∷
   rw 9 q2 ∷
   re 7 3 (ℓ "举") ∷
   rw⁻ 8 q11 ∷
   rw 9 q6 ∷
   re 7 1 (ℓ "乏丷乏") ∷
   rw 6 q2 ∷
   re 7 3 (ℓ "乑") ∷
   re 7 1 (ℓ "乏丼临丼乏") ∷
   rw 13 q2 ∷
   re 11 3 (ℓ "举") ∷
   rw 10 q29 ∷
   rw 9 q35 ∷
   rw 8 q31 ∷
   re 8 1 (ℓ "乏丷乏") ∷
   rw 7 q6 ∷
   re 8 5 (ℓ "乑") ∷
   re 8 1 (ℓ "乏乄乏") ∷
   rw 10 q6 ∷
   re 6 3 (ℓ "举") ∷
   rw 7 q2 ∷
   re 6 1 (ℓ "乏丷乏") ∷
   rw 8 q6 ∷
   rw 5 q7 ∷
   rw 6 q32 ∷
   rw 7 q2 ∷
   re 5 3 (ℓ "举") ∷
   rw⁻ 6 q7 ∷
   rw 7 q6 ∷
   rw 6 q2 ∷
   re 5 1 (ℓ "乏丷乏") ∷
   rw 7 q6 ∷
   rw 4 q14 ∷
   rw 5 q36 ∷
   rw 6 q2 ∷
   re 4 3 (ℓ "举") ∷
   rw⁻ 5 q14 ∷
   rw 6 q6 ∷
   rw 5 q2 ∷
   re 4 1 (ℓ "乏丷乏") ∷
   rw 6 q6 ∷
   rw 3 q11 ∷
   rw 4 q34 ∷
   rw 5 q2 ∷
   re 3 3 (ℓ "举") ∷
   rw⁻ 4 q11 ∷
   rw 5 q6 ∷
   rw 13 q16 ∷
   rw⁻ 12 q17 ∷
   rw 11 q18 ∷
   rw 12 q19 ∷
   rw 11 q17 ∷
   rw 12 q20 ∷
   rw 13 q21 ∷
   rw 10 q22 ∷
   rw 9 q23 ∷
   rw 8 q24 ∷
   rw 9 q16 ∷
   rw⁻ 8 q17 ∷
   rw 7 q25 ∷
   rw 8 q26 ∷
   rw 7 q17 ∷
   rw 8 q27 ∷
   rw 9 q21 ∷
   rw 6 q22 ∷
   rw 5 q28 ∷
   rw 4 q24 ∷ []) Eq.refl

private
  q37 : Eqn
  q37 = eqn (ℓ "丠乊") (ℓ "乊丠") (low-comm (CS) ((CS • CS • CS)))
  q38 : Eqn
  q38 = wE 457 W
  q39 : Eqn
  q39 = eqn (ℓ "与乊") (ℓ "乊与") (low-comm ((S ↑)) ((CS • CS • CS)))
  q40 : Eqn
  q40 = eqn (ℓ "並乊") (ℓ "乊並") (low-comm (Swap) ((CS • CS • CS)))
  q41 : Eqn
  q41 = wE 7 W
  q42 : Eqn
  q42 = wE 416 W
  q43 : Eqn
  q43 = wE 27 W
  q44 : Eqn
  q44 = wE 626 W

-- groups [CS02 CS02 CK20 CS02 CX21 CS01 CS01 CS01 CK10 S1 CS01 CS01 CS01 CS01 CS01 CS01 CX21 CS01 CS01 CK10 CS01] [CSd23]: 45 steps
lem-groups-CS02-CS02-CK20-CS02-CX21-CS01-CS01-CS01-CK10-S1-CS01-CS01-CS01-CS01-CS01-CS01-CX21-CS01-CS01-CK10-CS01-vs-CSd23 : ⟪ (ℓ "丧丧乄丧乆丠丠丠临与丠丠丠丠丠丠乆丠丠临丠乊") ⟫ʷ ≈ ⟪ (ℓ "乊丧丧乄丧乆丠丠丠临与丠丠丠丠丠丠乆丠丠临丠") ⟫ʷ
lem-groups-CS02-CS02-CK20-CS02-CX21-CS01-CS01-CS01-CK10-S1-CS01-CS01-CS01-CS01-CS01-CS01-CX21-CS01-CS01-CK10-CS01-vs-CSd23 = derive (ℓ "丧丧乄丧乆丠丠丠临与丠丠丠丠丠丠乆丠丠临丠乊") (ℓ "乊丧丧乄丧乆丠丠丠临与丠丠丠丠丠丠乆丠丠临丠")
  (rw 20 q37 ∷
   rw 19 q35 ∷
   rw 18 q37 ∷
   rw 17 q37 ∷
   rw 16 q38 ∷
   rw 15 q37 ∷
   rw 14 q37 ∷
   rw 13 q37 ∷
   rw 12 q37 ∷
   rw 11 q37 ∷
   rw 10 q37 ∷
   rw 9 q39 ∷
   rw 8 q35 ∷
   rw 7 q37 ∷
   rw 6 q37 ∷
   rw 5 q37 ∷
   rw 4 q38 ∷
   rw 5 q16 ∷
   rw⁻ 4 q40 ∷
   rw 3 q41 ∷
   rw 4 q42 ∷
   rw 3 q40 ∷
   rw 4 q43 ∷
   rw 5 q21 ∷
   rw 4 q16 ∷
   rw⁻ 3 q40 ∷
   rw 2 q25 ∷
   rw 3 q44 ∷
   rw 2 q40 ∷
   rw 3 q27 ∷
   rw 4 q21 ∷
   rw 3 q16 ∷
   rw⁻ 2 q40 ∷
   rw 1 q41 ∷
   rw 2 q42 ∷
   rw 1 q40 ∷
   rw 2 q43 ∷
   rw 3 q21 ∷
   rw 2 q16 ∷
   rw⁻ 1 q40 ∷
   rw 0 q41 ∷
   rw 1 q42 ∷
   rw 0 q40 ∷
   rw 1 q43 ∷
   rw 2 q21 ∷ []) Eq.refl

private
  q45 : Eqn
  q45 = wE 12 W
  q46 : Eqn
  q46 = wE 338 W
  q47 : Eqn
  q47 = wE 14 W
  q48 : Eqn
  q48 = wE 379 W
  q49 : Eqn
  q49 = wE 361 W
  q50 : Eqn
  q50 = eqn (ℓ "並乏") (ℓ "乏並") (low-comm (Swap) (Swap))
  q51 : Eqn
  q51 = wE 151 W
  q52 : Eqn
  q52 = eqn (ℓ "丼业") (ℓ "业丼") (low₃-comm ((Swap ↑)) (S))
  q53 : Eqn
  q53 = eqn (ℓ "並业") (ℓ "业並") (low-comm (Swap) ((S ↑)))
  q54 : Eqn
  q54 = wE 1195 W

-- bridge G-ki: 86 steps
lem-bridge-G-ki : ⟪ (ℓ "丠丠临丠丹丼丠丠丠临与丠丠丠丠丠丠丼丹丼丠丠临丠丼並丼乏乍乏丼並丠丠丠临与丠丠丠丠丠丠丹丼丠丠临丠丼丹丼丠丠丠临与丠丠丠丠丠丠丼並丼乏且乍乏丼並") ⟫ʷ ≈ ⟪ (ℓ "丠丠临丠丹丧丧丧乄且丧丧丧丧丧丧丹丧丧乄丧乑丧丧丧且乄丧丧丧丧丧丧丹丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧且且且且乄丧丧丧丧丧丧丧丧丧丹丠丠丠与临丠丠丠丠丠丠业乑") ⟫ʷ
lem-bridge-G-ki = derive (ℓ "丠丠临丠丹丼丠丠丠临与丠丠丠丠丠丠丼丹丼丠丠临丠丼並丼乏乍乏丼並丠丠丠临与丠丠丠丠丠丠丹丼丠丠临丠丼丹丼丠丠丠临与丠丠丠丠丠丠丼並丼乏且乍乏丼並") (ℓ "丠丠临丠丹丧丧丧乄且丧丧丧丧丧丧丹丧丧乄丧乑丧丧丧且乄丧丧丧丧丧丧丹丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧且且且且乄丧丧丧丧丧丧丧丧丧丹丠丠丠与临丠丠丠丠丠丠业乑")
  (rw 7 q45 ∷
   re 5 3 (ℓ "丧") ∷
   rw 8 q45 ∷
   re 6 3 (ℓ "丧") ∷
   rw 9 q45 ∷
   re 7 3 (ℓ "丧") ∷
   rw 10 q45 ∷
   re 8 3 (ℓ "乄") ∷
   rw 9 q46 ∷
   rw 12 q45 ∷
   re 10 3 (ℓ "丧") ∷
   rw 13 q45 ∷
   re 11 3 (ℓ "丧") ∷
   rw 14 q45 ∷
   re 12 3 (ℓ "丧") ∷
   rw 15 q45 ∷
   re 13 3 (ℓ "丧") ∷
   rw 16 q45 ∷
   re 14 3 (ℓ "丧") ∷
   rw 17 q45 ∷
   re 15 3 (ℓ "丧") ∷
   rw 16 q47 ∷
   rw 19 q45 ∷
   re 17 3 (ℓ "丧") ∷
   rw 20 q45 ∷
   re 18 3 (ℓ "丧") ∷
   rw 21 q45 ∷
   re 19 3 (ℓ "乄") ∷
   rw 22 q45 ∷
   re 20 3 (ℓ "丧") ∷
   rw 21 q47 ∷
   rw 42 q45 ∷
   re 40 3 (ℓ "丧") ∷
   rw 43 q45 ∷
   re 41 3 (ℓ "丧") ∷
   rw 44 q45 ∷
   re 42 3 (ℓ "乄") ∷
   rw 45 q45 ∷
   re 43 3 (ℓ "丧") ∷
   rw 44 q47 ∷
   rw 47 q45 ∷
   re 45 3 (ℓ "丧") ∷
   rw 48 q45 ∷
   re 46 3 (ℓ "丧") ∷
   rw 49 q45 ∷
   re 47 3 (ℓ "丧") ∷
   rw 50 q45 ∷
   re 48 3 (ℓ "乄") ∷
   rw 49 q46 ∷
   rw 52 q45 ∷
   re 50 3 (ℓ "丧") ∷
   rw 53 q45 ∷
   re 51 3 (ℓ "丧") ∷
   rw 54 q45 ∷
   re 52 3 (ℓ "丧") ∷
   rw 55 q45 ∷
   re 53 3 (ℓ "丧") ∷
   rw 56 q45 ∷
   re 54 3 (ℓ "丧") ∷
   rw 57 q45 ∷
   re 55 3 (ℓ "丧") ∷
   rw 56 q47 ∷
   rw 23 q48 ∷
   rw 24 q6 ∷
   rw 22 q49 ∷
   rw 23 q47 ∷
   re 22 1 (ℓ "乏乇乏") ∷
   rw 21 q50 ∷
   rw 22 q27 ∷
   rw 23 q50 ∷
   re 21 3 (ℓ "乑") ∷
   rw 22 q21 ∷
   rw 52 q51 ∷
   rw 53 q48 ∷
   rw 54 q6 ∷
   rw 51 q52 ∷
   rw 52 q49 ∷
   rw 53 q47 ∷
   rw 50 q53 ∷
   re 52 1 (ℓ "乏乇乏") ∷
   rw 51 q50 ∷
   rw 52 q27 ∷
   rw 53 q50 ∷
   re 51 3 (ℓ "乑") ∷
   rw 52 q21 ∷
   rw 22 q54 ∷ []) Eq.refl

private
  q55 : Eqn
  q55 = wE 1196 W
  q56 : Eqn
  q56 = wE 1197 W
  q57 : Eqn
  q57 = wE 1198 W
  q58 : Eqn
  q58 = eqn (ℓ "丠丠临丠丹丧丧丧乄且丧丧丧丧丧丧丹丧丧乄丧乑丧丧丧且乄丧丧丧丧丧丧丹丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧且且且且乄丧丧丧丧丧丧丧丧丧丹丠丠丠与临丠丠丠丠丠丠业乑丒习丽习举丒丠丠临丠丹丧丧丧乄且丧丧丧丧丧丧丹丧丧乄丧乑丧丧丧且乄丧丧丧丧丧丧丹丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧且且且且乄丧丧丧丧丧丧丧丧丧丹丠丠丠与临丠丠丠丠丠丠业乑丒习丽习举丒丒习丽习举丒丒习丽习举丒九中九丮") [] (trans (by-assoc Eq.refl) (trans (ax hyb-sq) (by-assoc Eq.refl)))
  q59 : Eqn
  q59 = wE 387 W

-- top ki-sq: 8 steps
lem-top-ki-sq : ⟪ (ℓ "丌丠丠临丠丹丧丧丧乄且丧丧丧丧丧丧丹丧丧乄丧乑丧丧丧且乄丧丧丧丧丧丧丹丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧且且且且乄丧丧丧丧丧丧丧丧丧丹丠丠丠与临丠丠丠丠丠丠业乑丌丌丒习丽习举丌丒丌丠丠临丠丹丧丧丧乄且丧丧丧丧丧丧丹丧丧乄丧乑丧丧丧且乄丧丧丧丧丧丧丹丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧且且且且乄丧丧丧丧丧丧丧丧丧丹丠丠丠与临丠丠丠丠丠丠业乑丌丌丒习丽习举丌丒丌丒习丽习举丌丒丌丒习丽习举丌丒丌九中九丮丌") ⟫ʷ ≈ ⟪ [] ⟫ʷ
lem-top-ki-sq = derive (ℓ "丌丠丠临丠丹丧丧丧乄且丧丧丧丧丧丧丹丧丧乄丧乑丧丧丧且乄丧丧丧丧丧丧丹丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧且且且且乄丧丧丧丧丧丧丧丧丧丹丠丠丠与临丠丠丠丠丠丠业乑丌丌丒习丽习举丌丒丌丠丠临丠丹丧丧丧乄且丧丧丧丧丧丧丹丧丧乄丧乑丧丧丧且乄丧丧丧丧丧丧丹丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧且且且且乄丧丧丧丧丧丧丧丧丧丹丠丠丠与临丠丠丠丠丠丠业乑丌丌丒习丽习举丌丒丌丒习丽习举丌丒丌丒习丽习举丌丒丌九中九丮丌") []
  (rw 194 q55 ∷
   rw 186 q56 ∷
   rw 178 q56 ∷
   rw 171 q57 ∷
   rw 88 q55 ∷
   rw 81 q57 ∷
   rw 1 q58 ∷
   rw 0 q59 ∷ []) Eq.refl

private
  q60 : Eqn
  q60 = eqn (ℓ "丒丠丠临丠丹丧丧丧乄且丧丧丧丧丧丧丹丧丧乄丧乑丧丧丧且乄丧丧丧丧丧丧丹丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧且且且且乄丧丧丧丧丧丧丧丧丧丹丠丠丠与临丠丠丠丠丠丠业乑丒丒丘乣义乣乊丒丘丌丠丠临丠丹丧丧丧乄且丧丧丧丧丧丧丹丧丧乄丧乑丧丧丧且乄丧丧丧丧丧丧丹丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧且且且且乄丧丧丧丧丧丧丧丧丧丹丠丠丠与临丠丠丠丠丠丠业乑丌丒丘乣义乣乊丒丘丒九中九丮丒丌丒习丽习举丌丒丒丈上中九丮九下三丒丌丒丠丠两丠个丶丶丶乇且丶丶丶丶丶丶个丶丶乇丶乔丶丶丶且乇丶丶丶丶丶丶个丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶且且且且乇丶丶丶丶丶丶丶丶丶个丠丠丠丈两丠丠丠丠丠丠业乔丌丒丌丒丈上中九丮九下三丌丒丒丘乣义乣乊丒丘丌丒与丐丽习举习丑丏丌丒丌丠丠临丠丹丧丧丧乄且丧丧丧丧丧丧丹丧丧乄丧乑丧丧丧且乄丧丧丧丧丧丧丹丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧且且且且乄丧丧丧丧丧丧丧丧丧丹丠丠丠与临丠丠丠丠丠丠业乑丌丌与丐丽习举习丑丏丌丒丘乣义乣乊丒丘丒九中九丮丒") (ℓ "丒丈上中九丮九下三丒丌丒丠丠两丠个丶丶丶乇且丶丶丶丶丶丶个丶丶乇丶乔丶丶丶且乇丶丶丶丶丶丶个丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶且且且且乇丶丶丶丶丶丶丶丶丶个丠丠丠丈两丠丠丠丠丠丠业乔丌丒丌丒丈上中九丮九下三丌丒丒丘乣义乣乊丒丘丌丒与丐丽习举习丑丏丌丒丌丠丠临丠丹丧丧丧乄且丧丧丧丧丧丧丹丧丧乄丧乑丧丧丧且乄丧丧丧丧丧丧丹丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧且且且且乄丧丧丧丧丧丧丧丧丧丹丠丠丠与临丠丠丠丠丠丠业乑丌丌与丐丽习举习丑丏丌丒丘乣义乣乊丒丘丒九中九丮丒丒丠丠临丠丹丧丧丧乄且丧丧丧丧丧丧丹丧丧乄丧乑丧丧丧且乄丧丧丧丧丧丧丹丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧且且且且乄丧丧丧丧丧丧丧丧丧丹丠丠丠与临丠丠丠丠丠丠业乑丒丒丘乣义乣乊丒丘丌丠丠临丠丹丧丧丧乄且丧丧丧丧丧丧丹丧丧乄丧乑丧丧丧且乄丧丧丧丧丧丧丹丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧且且且且乄丧丧丧丧丧丧丧丧丧丹丠丠丠与临丠丠丠丠丠丠业乑丌丒丘乣义乣乊丒丘丒九中九丮丒丌丒习丽习举丌丒") (trans (by-assoc Eq.refl) (trans (ax hyb-yb) (by-assoc Eq.refl)))

-- top ki-yb: 1 steps
lem-top-ki-yb : ⟪ (ℓ "丒丠丠临丠丹丧丧丧乄且丧丧丧丧丧丧丹丧丧乄丧乑丧丧丧且乄丧丧丧丧丧丧丹丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧且且且且乄丧丧丧丧丧丧丧丧丧丹丠丠丠与临丠丠丠丠丠丠业乑丒丒丘乣义乣乊丒丘丌丠丠临丠丹丧丧丧乄且丧丧丧丧丧丧丹丧丧乄丧乑丧丧丧且乄丧丧丧丧丧丧丹丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧且且且且乄丧丧丧丧丧丧丧丧丧丹丠丠丠与临丠丠丠丠丠丠业乑丌丒丘乣义乣乊丒丘丒九中九丮丒丌丒习丽习举丌丒丒丈上中九丮九下三丒丌丒丠丠两丠个丶丶丶乇且丶丶丶丶丶丶个丶丶乇丶乔丶丶丶且乇丶丶丶丶丶丶个丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶且且且且乇丶丶丶丶丶丶丶丶丶个丠丠丠丈两丠丠丠丠丠丠业乔丌丒丌丒丈上中九丮九下三丌丒丒丘乣义乣乊丒丘丌丒与丐丽习举习丑丏丌丒丌丠丠临丠丹丧丧丧乄且丧丧丧丧丧丧丹丧丧乄丧乑丧丧丧且乄丧丧丧丧丧丧丹丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧且且且且乄丧丧丧丧丧丧丧丧丧丹丠丠丠与临丠丠丠丠丠丠业乑丌丌与丐丽习举习丑丏丌丒丘乣义乣乊丒丘丒九中九丮丒") ⟫ʷ ≈ ⟪ (ℓ "丒丈上中九丮九下三丒丌丒丠丠两丠个丶丶丶乇且丶丶丶丶丶丶个丶丶乇丶乔丶丶丶且乇丶丶丶丶丶丶个丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶且且且且乇丶丶丶丶丶丶丶丶丶个丠丠丠丈两丠丠丠丠丠丠业乔丌丒丌丒丈上中九丮九下三丌丒丒丘乣义乣乊丒丘丌丒与丐丽习举习丑丏丌丒丌丠丠临丠丹丧丧丧乄且丧丧丧丧丧丧丹丧丧乄丧乑丧丧丧且乄丧丧丧丧丧丧丹丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧且且且且乄丧丧丧丧丧丧丧丧丧丹丠丠丠与临丠丠丠丠丠丠业乑丌丌与丐丽习举习丑丏丌丒丘乣义乣乊丒丘丒九中九丮丒丒丠丠临丠丹丧丧丧乄且丧丧丧丧丧丧丹丧丧乄丧乑丧丧丧且乄丧丧丧丧丧丧丹丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧且且且且乄丧丧丧丧丧丧丧丧丧丹丠丠丠与临丠丠丠丠丠丠业乑丒丒丘乣义乣乊丒丘丌丠丠临丠丹丧丧丧乄且丧丧丧丧丧丧丹丧丧乄丧乑丧丧丧且乄丧丧丧丧丧丧丹丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧且且且且乄丧丧丧丧丧丧丧丧丧丹丠丠丠与临丠丠丠丠丠丠业乑丌丒丘乣义乣乊丒丘丒九中九丮丒丌丒习丽习举丌丒") ⟫ʷ
lem-top-ki-yb = derive (ℓ "丒丠丠临丠丹丧丧丧乄且丧丧丧丧丧丧丹丧丧乄丧乑丧丧丧且乄丧丧丧丧丧丧丹丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧且且且且乄丧丧丧丧丧丧丧丧丧丹丠丠丠与临丠丠丠丠丠丠业乑丒丒丘乣义乣乊丒丘丌丠丠临丠丹丧丧丧乄且丧丧丧丧丧丧丹丧丧乄丧乑丧丧丧且乄丧丧丧丧丧丧丹丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧且且且且乄丧丧丧丧丧丧丧丧丧丹丠丠丠与临丠丠丠丠丠丠业乑丌丒丘乣义乣乊丒丘丒九中九丮丒丌丒习丽习举丌丒丒丈上中九丮九下三丒丌丒丠丠两丠个丶丶丶乇且丶丶丶丶丶丶个丶丶乇丶乔丶丶丶且乇丶丶丶丶丶丶个丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶且且且且乇丶丶丶丶丶丶丶丶丶个丠丠丠丈两丠丠丠丠丠丠业乔丌丒丌丒丈上中九丮九下三丌丒丒丘乣义乣乊丒丘丌丒与丐丽习举习丑丏丌丒丌丠丠临丠丹丧丧丧乄且丧丧丧丧丧丧丹丧丧乄丧乑丧丧丧且乄丧丧丧丧丧丧丹丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧且且且且乄丧丧丧丧丧丧丧丧丧丹丠丠丠与临丠丠丠丠丠丠业乑丌丌与丐丽习举习丑丏丌丒丘乣义乣乊丒丘丒九中九丮丒") (ℓ "丒丈上中九丮九下三丒丌丒丠丠两丠个丶丶丶乇且丶丶丶丶丶丶个丶丶乇丶乔丶丶丶且乇丶丶丶丶丶丶个丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶且且且且乇丶丶丶丶丶丶丶丶丶个丠丠丠丈两丠丠丠丠丠丠业乔丌丒丌丒丈上中九丮九下三丌丒丒丘乣义乣乊丒丘丌丒与丐丽习举习丑丏丌丒丌丠丠临丠丹丧丧丧乄且丧丧丧丧丧丧丹丧丧乄丧乑丧丧丧且乄丧丧丧丧丧丧丹丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧且且且且乄丧丧丧丧丧丧丧丧丧丹丠丠丠与临丠丠丠丠丠丠业乑丌丌与丐丽习举习丑丏丌丒丘乣义乣乊丒丘丒九中九丮丒丒丠丠临丠丹丧丧丧乄且丧丧丧丧丧丧丹丧丧乄丧乑丧丧丧且乄丧丧丧丧丧丧丹丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧且且且且乄丧丧丧丧丧丧丧丧丧丹丠丠丠与临丠丠丠丠丠丠业乑丒丒丘乣义乣乊丒丘丌丠丠临丠丹丧丧丧乄且丧丧丧丧丧丧丹丧丧乄丧乑丧丧丧且乄丧丧丧丧丧丧丹丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧且且且且乄丧丧丧丧丧丧丧丧丧丹丠丠丠与临丠丠丠丠丠丠业乑丌丒丘乣义乣乊丒丘丒九中九丮丒丌丒习丽习举丌丒")
  (rw 0 q60 ∷ []) Eq.refl

private
  q61 : Eqn
  q61 = wE 1199 W
  q62 : Eqn
  q62 = wE 1200 W

-- respell hyb CS02 CS02 CK20 CS02 CX21 CS01 CS01 CS01  -> CS01 CS01 CK10 CS01 CX12 CS02 CS02 CS02 : 2 steps
lem-respell-hyb-CS02-CS02-CK20-CS02-CX21-CS01-CS01-CS01---⟶-CS01-CS01-CK10-CS01-CX12-CS02-CS02-CS02- : ⟪ (ℓ "丧丧乄丧乆丠丠丠临与丠丠丠丠丠丠乆丠丠临丠乑丠丠丠与临丠丠丠丠丠丠乆丠丠丠丠丠丠丠丠丠丠丠丠丠丠丠丠丠丠与与与与临丠丠丠丠丠丠丠丠丠乆丧丧丧且乄丧丧丧丧丧丧业乑") ⟫ʷ ≈ ⟪ (ℓ "丠丠临丠丹丧丧丧乄且丧丧丧丧丧丧丹丧丧乄丧乑丧丧丧且乄丧丧丧丧丧丧丹丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧且且且且乄丧丧丧丧丧丧丧丧丧丹丠丠丠与临丠丠丠丠丠丠业乑") ⟫ʷ
lem-respell-hyb-CS02-CS02-CK20-CS02-CX21-CS01-CS01-CS01---⟶-CS01-CS01-CK10-CS01-CX12-CS02-CS02-CS02- = derive (ℓ "丧丧乄丧乆丠丠丠临与丠丠丠丠丠丠乆丠丠临丠乑丠丠丠与临丠丠丠丠丠丠乆丠丠丠丠丠丠丠丠丠丠丠丠丠丠丠丠丠丠与与与与临丠丠丠丠丠丠丠丠丠乆丧丧丧且乄丧丧丧丧丧丧业乑") (ℓ "丠丠临丠丹丧丧丧乄且丧丧丧丧丧丧丹丧丧乄丧乑丧丧丧且乄丧丧丧丧丧丧丹丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧且且且且乄丧丧丧丧丧丧丧丧丧丹丠丠丠与临丠丠丠丠丠丠业乑")
  (rw 0 q61 ∷
   rw 22 q62 ∷ []) Eq.refl

private
  q63 : Eqn
  q63 = wE 1201 W
  q64 : Eqn
  q64 = wE 1202 W

-- respell hyb CS12 CS12 CK21 CS12 CX20 CS01 CS01 CS01  -> CS01 CS01 CK01 CS01 CX02 CS12 CS12 CS12 : 2 steps
lem-respell-hyb-CS12-CS12-CK21-CS12-CX20-CS01-CS01-CS01---⟶-CS01-CS01-CK01-CS01-CX02-CS12-CS12-CS12- : ⟪ (ℓ "丶丶乇丶乃丠丠丠两丈丠丠丠丠丠丠乃丠丠两丠乔丠丠丠丈两丠丠丠丠丠丠乃丠丠丠丠丠丠丠丠丠丠丠丠丠丠丠丠丠丠丈丈丈丈两丠丠丠丠丠丠丠丠丠乃丶丶丶且乇丶丶丶丶丶丶业乔") ⟫ʷ ≈ ⟪ (ℓ "丠丠两丠个丶丶丶乇且丶丶丶丶丶丶个丶丶乇丶乔丶丶丶且乇丶丶丶丶丶丶个丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶且且且且乇丶丶丶丶丶丶丶丶丶个丠丠丠丈两丠丠丠丠丠丠业乔") ⟫ʷ
lem-respell-hyb-CS12-CS12-CK21-CS12-CX20-CS01-CS01-CS01---⟶-CS01-CS01-CK01-CS01-CX02-CS12-CS12-CS12- = derive (ℓ "丶丶乇丶乃丠丠丠两丈丠丠丠丠丠丠乃丠丠两丠乔丠丠丠丈两丠丠丠丠丠丠乃丠丠丠丠丠丠丠丠丠丠丠丠丠丠丠丠丠丠丈丈丈丈两丠丠丠丠丠丠丠丠丠乃丶丶丶且乇丶丶丶丶丶丶业乔") (ℓ "丠丠两丠个丶丶丶乇且丶丶丶丶丶丶个丶丶乇丶乔丶丶丶且乇丶丶丶丶丶丶个丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶且且且且乇丶丶丶丶丶丶丶丶丶个丠丠丠丈两丠丠丠丠丠丠业乔")
  (rw 0 q63 ∷
   rw 22 q64 ∷ []) Eq.refl

private
  q65 : Eqn
  q65 = wE 1203 W
  q66 : Eqn
  q66 = wE 1204 W

-- respell hyb CS01 CS01 CK10 CS01 CX12 CS02 CS02 CS02  -> CS02 CS02 CK20 CS02 CX21 CS01 CS01 CS01 : 2 steps
lem-respell-hyb-CS01-CS01-CK10-CS01-CX12-CS02-CS02-CS02---⟶-CS02-CS02-CK20-CS02-CX21-CS01-CS01-CS01- : ⟪ (ℓ "丠丠临丠丹丧丧丧乄且丧丧丧丧丧丧丹丧丧乄丧乑丧丧丧且乄丧丧丧丧丧丧丹丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧且且且且乄丧丧丧丧丧丧丧丧丧丹丠丠丠与临丠丠丠丠丠丠业乑") ⟫ʷ ≈ ⟪ (ℓ "丧丧乄丧乆丠丠丠临与丠丠丠丠丠丠乆丠丠临丠乑丠丠丠与临丠丠丠丠丠丠乆丠丠丠丠丠丠丠丠丠丠丠丠丠丠丠丠丠丠与与与与临丠丠丠丠丠丠丠丠丠乆丧丧丧且乄丧丧丧丧丧丧业乑") ⟫ʷ
lem-respell-hyb-CS01-CS01-CK10-CS01-CX12-CS02-CS02-CS02---⟶-CS02-CS02-CK20-CS02-CX21-CS01-CS01-CS01- = derive (ℓ "丠丠临丠丹丧丧丧乄且丧丧丧丧丧丧丹丧丧乄丧乑丧丧丧且乄丧丧丧丧丧丧丹丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧丧且且且且乄丧丧丧丧丧丧丧丧丧丹丠丠丠与临丠丠丠丠丠丠业乑") (ℓ "丧丧乄丧乆丠丠丠临与丠丠丠丠丠丠乆丠丠临丠乑丠丠丠与临丠丠丠丠丠丠乆丠丠丠丠丠丠丠丠丠丠丠丠丠丠丠丠丠丠与与与与临丠丠丠丠丠丠丠丠丠乆丧丧丧且乄丧丧丧丧丧丧业乑")
  (rw 0 q65 ∷
   rw 22 q66 ∷ []) Eq.refl
