------------------------------------------------------------------------
-- Presentations of groups
--
-- The tree from a hard state to the normal forms (generated).
------------------------------------------------------------------------

{-# OPTIONS --without-K --safe #-}

module Examples.Groups.Real-Clifford+CH-TwoLevel-Clement.TreeTop where

open import Data.Bool.Base using (true ; false)
open import Data.Fin.Base using (Fin ; zero ; suc)
open import Data.Integer.Base using (+_ ; -[1+_])
open import Data.List.Base using ([] ; _∷_)
open import Data.Maybe.Base using (Maybe ; just ; nothing)
open import Data.Nat.Base using (ℕ ; suc)

open import Data.Vec.Base using (Vec ; [] ; _∷_)
open import Relation.Binary.PropositionalEquality using (_≡_ ; refl)

open import Quantum.Synthesis.Ring using (RootTwo)
open import Examples.Groups.Real-Clifford+CH-TwoLevel.Ring using (Z)
open import Examples.Groups.Real-Clifford+CH-TwoLevel-Clement.Forms using (Form ; form)
open import Examples.Groups.Real-Clifford+CH-TwoLevel-Clement.Check using (Hˡ ; Zˡ)
open import Examples.Groups.Real-Clifford+CH-TwoLevel-Clement.Tree

open import Examples.Groups.Real-Clifford+CH-TwoLevel-Clement.NFs using (nfData)

private
  𝟎 𝟏 -𝟏 𝟐 : Z
  𝟎 = RootTwo (+ 0) (+ 0)
  𝟏 = RootTwo (+ 1) (+ 0)
  -𝟏 = RootTwo -[1+ 0 ] (+ 0)
  𝟐 = RootTwo (+ 2) (+ 0)
  f0 : ∀ {m} → Fin (suc m)
  f0 = zero
  f1 : ∀ {m} → Fin (suc (suc m))
  f1 = suc f0
  f2 : ∀ {m} → Fin (suc (suc (suc m)))
  f2 = suc f1
  f3 : ∀ {m} → Fin (suc (suc (suc (suc m))))
  f3 = suc f2
  f4 : ∀ {m} → Fin (suc (suc (suc (suc (suc m)))))
  f4 = suc f3
  f5 : ∀ {m} → Fin (suc (suc (suc (suc (suc (suc m))))))
  f5 = suc f4

top : Tree 4 4
top = (split f2 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (split f3 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (split f2 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (split f3 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (extend 1 (just false) ((Hˡ f0 f2) ∷ (Hˡ f1 f3) ∷ []) f0 f2 f1 f3 []
 (extend 1 (just true) ((Hˡ f1 f3) ∷ (Hˡ f2 f4) ∷ []) f0 f3 f1 f4 []
 (split f2 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (split f3 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f0)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ [])))))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f1)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f1)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ [])))))))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ [])))))))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f3)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 1) (+ 1)) (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f3)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 1) (+ 1)) (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ []))))))))
 (split f3 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f0)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ [])))))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f1)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f1)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ [])))))))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f3)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ [])))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f3)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 1 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ []))))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 1 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))))))))))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ []) true f0 f1
 (useNF nf341 ((form 𝟎 (𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 ((RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ []) true f0 f1
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (useNF nf341 ((form 𝟏 (𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) ((RootTwo (+ 0) -[1+ 0 ]) ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 ((RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟐 ∷ 𝟎 ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ []) false f0 f1
 (useNF nf341 ((form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 ((RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ []) false f0 f1
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (useNF nf341 ((form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) ((RootTwo (+ 0) -[1+ 0 ]) ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 ((RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟐 ∷ 𝟎 ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))))))
 (split f3 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ []) true f0 f1
 (useNF nf341 ((form 𝟎 (𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 ((RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ []) true f0 f1
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (useNF nf341 ((form 𝟏 (𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) ((RootTwo (+ 0) -[1+ 0 ]) ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 ((RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟐 ∷ 𝟎 ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ []) false f0 f1
 (useNF nf341 ((form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 ((RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ []) false f0 f1
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (useNF nf341 ((form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) ((RootTwo (+ 0) -[1+ 0 ]) ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 ((RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟐 ∷ 𝟎 ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))))
 (extend 1 (just true) ((Hˡ f0 f2) ∷ (Hˡ f1 f3) ∷ []) f0 f2 f1 f3 []
 (extend 1 (just false) ((Hˡ f1 f3) ∷ (Hˡ f2 f4) ∷ []) f0 f3 f1 f4 []
 (split f2 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (split f3 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) (+ 1)) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f0)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) (+ 1)) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ [])))))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f1)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) (+ 1)) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 1) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f1)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) (+ 1)) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 1) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ [])))))))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ [])))))))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f3)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 1) (+ 1)) (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f3)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 1) (+ 1)) (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ []))))))))
 (split f3 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) (+ 1)) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f0)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) (+ 1)) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 1) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ [])))))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f1)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) (+ 1)) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f1)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) (+ 1)) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 1) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ [])))))))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f3)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ [])))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f3)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 1 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ []))))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 1 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))))))))))))
 (split f2 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (split f3 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ []) true f0 f1
 (conj (Zˡ f2)
 (useNF nf341 ((form 𝟎 (𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) ((RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ []) true f0 f1
 (conj (Zˡ f1)
 (conj (Zˡ f2)
 (conj (Zˡ f3)
 (useNF nf341 ((form 𝟏 (𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) ((RootTwo (+ 0) -[1+ 0 ]) ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 1 ]) ((RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟐 (𝟐 ∷ (RootTwo (+ 0) (+ 1)) ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ []) false f0 f1
 (conj (Zˡ f3)
 (useNF nf341 ((form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 ((RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ []) false f0 f1
 (conj (Zˡ f1)
 (useNF nf341 ((form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) ((RootTwo (+ 0) -[1+ 0 ]) ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 ((RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 2) (+ 1)) (𝟐 ∷ (RootTwo (+ 0) (+ 1)) ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))))
 (extend 1 (just false) ((Hˡ f0 f2) ∷ (Hˡ f1 f3) ∷ []) f0 f1 f2 f3 []
 (extend 1 (just true) ((Hˡ f1 f3) ∷ (Hˡ f2 f4) ∷ []) f0 f2 f1 f3 []
 (split f2 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (split f3 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f1)
 (conj (Zˡ f4)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f1)
 (conj (Zˡ f4)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ [])))))))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f4)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f4)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ [])))))))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (conj (Zˡ f4)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 1 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (conj (Zˡ f4)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 1 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ []))))))))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f3)
 (conj (Zˡ f4)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 1 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f3)
 (conj (Zˡ f4)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 1 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ [])))))))))
 (split f3 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ [])))))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f1)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f1)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ [])))))))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f3)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f3)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ []))))))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ [])))))))))))))
 (split f3 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (extend 1 (just true) ((Hˡ f0 f2) ∷ (Hˡ f1 f3) ∷ []) f0 f1 f2 f3 []
 (extend 1 (just false) ((Hˡ f1 f3) ∷ (Hˡ f2 f4) ∷ []) f0 f2 f1 f3 []
 (split f2 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (split f3 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f1)
 (conj (Zˡ f4)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f1)
 (conj (Zˡ f4)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ [])))))))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f4)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f4)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ [])))))))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (conj (Zˡ f4)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 1 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (conj (Zˡ f4)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 1 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ []))))))))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f3)
 (conj (Zˡ f4)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 1 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f3)
 (conj (Zˡ f4)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 1 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ [])))))))))
 (split f3 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ [])))))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f1)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f1)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ [])))))))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f3)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f3)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ []))))))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ []))))))))))))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ []) true f0 f1
 (conj (Zˡ f2)
 (useNF nf341 ((form 𝟎 (𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) ((RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 1) (+ 1)) (𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ []) true f0 f1
 (conj (Zˡ f1)
 (conj (Zˡ f2)
 (conj (Zˡ f3)
 (useNF nf341 ((form 𝟏 (𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) ((RootTwo (+ 0) -[1+ 0 ]) ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 1 ]) ((RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟐 (𝟐 ∷ (RootTwo (+ 0) (+ 1)) ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ []) false f0 f1
 (conj (Zˡ f3)
 (useNF nf341 ((form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 ((RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 1 ]) (𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ []) false f0 f1
 (conj (Zˡ f1)
 (useNF nf341 ((form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) ((RootTwo (+ 0) -[1+ 0 ]) ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 ((RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 2) (+ 1)) (𝟐 ∷ (RootTwo (+ 0) (+ 1)) ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))))))
 (split f3 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (split f3 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (split f2 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (extend 1 (just false) ((Hˡ f0 f2) ∷ (Hˡ f1 f3) ∷ []) f0 f1 f2 f3 []
 (extend 1 (just true) ((Hˡ f1 f3) ∷ (Hˡ f2 f4) ∷ []) f0 f1 f2 f4 []
 (split f2 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (split f3 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ [])))))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f1)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f1)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ [])))))))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (useNF nf38 ((form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (useNF nf38 ((form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ [])))))))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f3)
 (useNF nf38 ((form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 1) (+ 1)) (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f3)
 (useNF nf38 ((form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 1) (+ 1)) (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ []))))))))
 (split f3 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f1)
 (conj (Zˡ f4)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f1)
 (conj (Zˡ f4)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ [])))))))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f4)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f4)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ [])))))))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (conj (Zˡ f4)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 2 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ [])))))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (conj (Zˡ f4)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 2 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 1 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))))))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f3)
 (conj (Zˡ f4)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 2 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ []))))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f3)
 (conj (Zˡ f4)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 2 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 1 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))))))))))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ []) true f0 f1
 (conj (Zˡ f3)
 (useNF nf341 ((form 𝟎 (𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 ((RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ []) true f0 f1
 (conj (Zˡ f1)
 (useNF nf341 ((form 𝟏 (𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) ((RootTwo (+ 0) -[1+ 0 ]) ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 ((RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟐 ∷ 𝟎 ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ []) false f0 f1
 (conj (Zˡ f2)
 (useNF nf341 ((form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) ((RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ []) false f0 f1
 (conj (Zˡ f1)
 (conj (Zˡ f2)
 (conj (Zˡ f3)
 (useNF nf341 ((form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) ((RootTwo (+ 0) -[1+ 0 ]) ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) ((RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 1) (+ 1)) (𝟐 ∷ 𝟎 ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))))))
 (split f2 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ []) true f0 f1
 (conj (Zˡ f3)
 (useNF nf341 ((form 𝟎 (𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 ((RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ []) true f0 f1
 (conj (Zˡ f1)
 (useNF nf341 ((form 𝟏 (𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) ((RootTwo (+ 0) -[1+ 0 ]) ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 ((RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 1) -[1+ 0 ]) (𝟐 ∷ 𝟎 ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ []) false f0 f1
 (conj (Zˡ f2)
 (useNF nf341 ((form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) ((RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ []) false f0 f1
 (conj (Zˡ f1)
 (conj (Zˡ f2)
 (conj (Zˡ f3)
 (useNF nf341 ((form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) ((RootTwo (+ 0) -[1+ 0 ]) ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) ((RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟐 ∷ 𝟎 ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))))))
 (extend 1 (just true) ((Hˡ f0 f2) ∷ (Hˡ f1 f3) ∷ []) f0 f1 f2 f3 []
 (extend 1 (just false) ((Hˡ f1 f3) ∷ (Hˡ f2 f4) ∷ []) f0 f1 f2 f4 []
 (split f2 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (split f3 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ [])))))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f1)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 1) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f1)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 1) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ [])))))))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (useNF nf38 ((form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 1) (+ 1)) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (useNF nf38 ((form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 1) (+ 1)) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ [])))))))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f3)
 (useNF nf38 ((form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 1) (+ 1)) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 1) (+ 1)) (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f3)
 (useNF nf38 ((form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 1) (+ 1)) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 1) (+ 1)) (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ []))))))))
 (split f3 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f1)
 (conj (Zˡ f4)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f1)
 (conj (Zˡ f4)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 1) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ [])))))))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f4)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f4)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 1) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ [])))))))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (conj (Zˡ f4)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 2 ] -[1+ 1 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ [])))))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (conj (Zˡ f4)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 2 ] -[1+ 1 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 1 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))))))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f3)
 (conj (Zˡ f4)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 2 ] -[1+ 1 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ []))))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f3)
 (conj (Zˡ f4)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 2 ] -[1+ 1 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 1 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))))))))))))
 (split f2 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (split f3 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ []) true f0 f1
 (conj (Zˡ f2)
 (conj (Zˡ f3)
 (useNF nf341 ((form 𝟎 (𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) ((RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ []) true f0 f1
 (conj (Zˡ f1)
 (conj (Zˡ f2)
 (useNF nf341 ((form 𝟏 (𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) ((RootTwo (+ 0) -[1+ 0 ]) ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 1 ]) ((RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 3) (+ 0)) (𝟐 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ []) false f0 f1
 (conj (Zˡ f2)
 (conj (Zˡ f3)
 (useNF nf341 ((form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) ((RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ []) false f0 f1
 (conj (Zˡ f1)
 (conj (Zˡ f2)
 (useNF nf341 ((form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) ((RootTwo (+ 0) -[1+ 0 ]) ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) ((RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 3) (+ 1)) (𝟐 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))))
 (extend 1 (just false) ((Hˡ f0 f2) ∷ (Hˡ f1 f3) ∷ []) f0 f2 f1 f3 []
 (extend 1 (just true) ((Hˡ f1 f3) ∷ (Hˡ f2 f4) ∷ []) f0 f1 f2 f3 []
 (split f2 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (split f3 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f1)
 (conj (Zˡ f4)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f1)
 (conj (Zˡ f4)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ [])))))))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f4)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f4)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ [])))))))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (conj (Zˡ f4)
 (useNF nf38 ((form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 1 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (conj (Zˡ f4)
 (useNF nf38 ((form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 1 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ []))))))))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f3)
 (conj (Zˡ f4)
 (useNF nf38 ((form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 1 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f3)
 (conj (Zˡ f4)
 (useNF nf38 ((form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 1 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ [])))))))))
 (split f3 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f1)
 (conj (Zˡ f4)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f1)
 (conj (Zˡ f4)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ [])))))))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f4)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f4)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ [])))))))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (conj (Zˡ f4)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (conj (Zˡ f4)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ []))))))))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f3)
 (conj (Zˡ f4)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f3)
 (conj (Zˡ f4)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ [])))))))))))))
 (split f3 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (extend 1 (just true) ((Hˡ f0 f2) ∷ (Hˡ f1 f3) ∷ []) f0 f2 f1 f3 []
 (extend 1 (just false) ((Hˡ f1 f3) ∷ (Hˡ f2 f4) ∷ []) f0 f1 f2 f3 []
 (split f2 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (split f3 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f1)
 (conj (Zˡ f4)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f1)
 (conj (Zˡ f4)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ [])))))))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f4)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f4)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ [])))))))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (conj (Zˡ f4)
 (useNF nf38 ((form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 1 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (conj (Zˡ f4)
 (useNF nf38 ((form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 1 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ []))))))))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f3)
 (conj (Zˡ f4)
 (useNF nf38 ((form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 1 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ f5 ∷ f4 ∷ []) true f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f3)
 (conj (Zˡ f4)
 (useNF nf38 ((form 𝟏 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 1 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form -𝟏 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ [])) ∷ [])))))))))
 (split f3 (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f1)
 (conj (Zˡ f4)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f1)
 (conj (Zˡ f4)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ [])))))))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f4)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f4)
 (conj (Zˡ f5)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ [])))))))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ []))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (conj (Zˡ f4)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f1)
 (conj (Zˡ f3)
 (conj (Zˡ f4)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ []))))))))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟏 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f3)
 (conj (Zˡ f4)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ f4 ∷ f5 ∷ []) false f2 f3
 (conj (Zˡ f0)
 (conj (Zˡ f3)
 (conj (Zˡ f4)
 (useNF nf38 ((form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (-𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ [])) ∷ []))))))))))))
 (split f0 (form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ []) true f0 f1
 (conj (Zˡ f2)
 (conj (Zˡ f3)
 (useNF nf341 ((form 𝟎 (𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) ((RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ (RootTwo (+ 0) (+ 1)) ∷ -𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))
 (relabel (f1 ∷ f0 ∷ f3 ∷ f2 ∷ []) true f0 f1
 (conj (Zˡ f1)
 (conj (Zˡ f2)
 (useNF nf341 ((form 𝟏 (𝟏 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) ((RootTwo (+ 0) -[1+ 0 ]) ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 1 ]) ((RootTwo (+ 0) -[1+ 0 ]) ∷ (RootTwo -[1+ 1 ] (+ 0)) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 3) (+ 1)) (𝟐 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ []))))))
 (split f1 (form 𝟎 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ []))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ []) false f0 f1
 (conj (Zˡ f2)
 (conj (Zˡ f3)
 (useNF nf341 ((form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 (𝟎 ∷ 𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) ((RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 0) -[1+ 0 ]) (𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟏 ∷ -𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))
 (relabel (f0 ∷ f1 ∷ f2 ∷ f3 ∷ []) false f0 f1
 (conj (Zˡ f1)
 (conj (Zˡ f2)
 (useNF nf341 ((form 𝟎 (𝟏 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 0 ] -[1+ 0 ]) ((RootTwo (+ 0) -[1+ 0 ]) ∷ -𝟏 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo -[1+ 1 ] -[1+ 0 ]) ((RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ (RootTwo (+ 0) -[1+ 0 ]) ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 3) (+ 2)) (𝟐 ∷ (RootTwo (+ 0) (+ 1)) ∷ 𝟏 ∷ 𝟏 ∷ [])) ∷ (form 𝟎 (𝟎 ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ [])))))))))))

topForms : Vec (Form 4) 4
topForms = ((form 𝟏 ((RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 1) (+ 1)) ((RootTwo (+ 0) (+ 1)) ∷ 𝟐 ∷ 𝟎 ∷ 𝟎 ∷ [])) ∷ (form 𝟏 ((RootTwo (+ 0) (+ 1)) ∷ 𝟎 ∷ 𝟐 ∷ 𝟎 ∷ [])) ∷ (form (RootTwo (+ 1) (+ 1)) ((RootTwo (+ 0) (+ 1)) ∷ 𝟐 ∷ 𝟎 ∷ 𝟐 ∷ [])) ∷ [])

topTags : Vec (Maybe ℕ) 4
topTags = (nothing ∷ nothing ∷ nothing ∷ nothing ∷ [])

open Checker nfData (λ _ → true) using (checkT)

top-ok : checkT top topTags true f0 f1 topForms ≡ true
top-ok = refl
